# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'docker'
cask 'google-chrome'
cask 'brave-browser'
cask 'firefox'
cask 'helo'
cask 'herd'
cask 'imageoptim'
cask 'phpstorm'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'adobe-creative-cloud'
cask 'microsoft-office'
cask 'spotify'
cask 'backblaze'
cask 'poedit'
cask 'postman'
cask 'raycast'
cask 'spectacle'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'logitech-options'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709